cfd/OpenFOAM/incompressible/simpleFoam/Validation/ONERA-M6/system/include/controlVolume
// control volume dimensions
controlVolOriginX  -2;
controlVolLength    8;
controlVolHalfWidth 2;
controlVolHeight    4;

// cell size
controlVolCellSize 0.1;