cfd/OpenFOAM/incompressible/simpleFoam/Validation/ONERA-M6/system/include/geometryRefinement
// near geometry refinement
nearGeometryRefinementDistance 0.5;
nearGeometryRefinementLevel 2;

// geometry surface refinement
surfaceRefinementLevelMin 3;
surfaceRefinementLevelMax 4;

// geometry features refinement
geometryFeaturesRefinementLevel 4;
