cfd/OpenFOAM/incompressible/simpleFoam/Validation/ONERA-M6/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "include/materialPoint"
#include "include/refinementCylinder"
#include "include/geometryRefinement"

// ************************************************************************* //

refinementCylinder_y_min #eval "$refinementCylinderCenter_y - $refinementCylinderDepth / 2.0";
refinementCylinder_y_max #eval "$refinementCylinderCenter_y + $refinementCylinderDepth / 2.0";

// ************************************************************************* //

// Which of the steps to run
castellatedMesh true;
snap            true;
addLayers       false;


// Geometry. Definition of all surfaces. All surfaces are of class
// searchableSurface.
// Surfaces are used
// - to specify refinement for any mesh cell intersecting it
// - to specify refinement for any mesh cell inside/outside/near
// - to 'snap' the mesh boundary to the surface
geometry
{
    model
    {
        type triSurfaceMesh;
        file "model.stl";
    }

    refinementCylinder
    {
        type searchableCylinder;
        point1 ($refinementCylinderCenter_x $refinementCylinder_y_min $refinementCylinderCenter_z);
        point2 ($refinementCylinderCenter_x $refinementCylinder_y_max $refinementCylinderCenter_z);
        radius $refinementCylinderRadius;
    }
};


// Settings for the castellatedMesh generation.
castellatedMeshControls
{
    // Mesh selection
    // ~~~~~~~~~~~~~~

    // Location vector inside the region to be meshed; vector must not coincide
    // with a cell face either before or during refinement.
    // After refinement patches get added for all refinementSurfaces and
    // all cells intersecting the surfaces get put into these patches. The
    // section reachable from the locationInMesh is kept.
    // NOTE: This point should never be on a face, always inside a cell, even
    // after refinement.
    locationInMesh ($materialPoint_x $materialPoint_y $materialPoint_z);
    
    // Whether any faceZones (as specified in the refinementSurfaces)
    // are only on the boundary of corresponding cellZones or also allow
    // free-standing zone faces. Not used if there are no faceZones.
    allowFreeStandingZoneFaces true;
    
    //
    // ~~~~~~~~~~~~~~

    // If local number of cells is >= maxLocalCells on any processor
    // switches from from refinement followed by balancing
    // (current method) to (weighted) balancing before refinement.
    maxLocalCells 1000000;

    // Overall cell limit (approximately). Refinement will stop immediately
    // upon reaching this number so a refinement level might not complete.
    // Note that this is the number of cells before removing the part which
    // is not 'visible' from the keepPoint. The final number of cells might
    // actually be a lot less.
    maxGlobalCells 2000000;

    // The surface refinement loop might spend lots of iterations refining just a
    // few cells. This setting will cause refinement to stop if <= minimumRefine
    // are selected for refinement. Note: it will at least do one iteration
    // (unless the number of cells to refine is 0)
    minRefinementCells 0;

    // Allow a certain level of imbalance during refining
    // (since balancing is quite expensive)
    // Expressed as fraction of perfect balance (= overall number of cells /
    // nProcs). 0=balance always.
    maxLoadUnbalance 0.1;

    // Number of buffer layers of cells between successive levels of refinement
    // (typically set to 3).
    // 1 means normal 2:1 refinement restriction, larger means slower
    // refinement.
    nCellsBetweenLevels 3;
    
    // Explicit feature edge refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies a level for any cell intersected by its edges.
    // This is a featureEdgeMesh, read from constant/triSurface for now.
    features
    (
        {
            file "model.eMesh";
            level $geometryFeaturesRefinementLevel;
        }
    );
    
    // Surface based refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~
    
    // Specifies two levels for every surface. The first is the minimum level,
    // every cell intersecting a surface gets refined up to the minimum level.
    // The second level is the maximum level. Cells that 'see' multiple
    // intersections where the intersections make an
    // angle > resolveFeatureAngle get refined up to the maximum level.
    refinementSurfaces
    {
        model
        {
            // Surface-wise min and max refinement level
            level ($surfaceRefinementLevelMin $surfaceRefinementLevelMax);

            // Optional specification of patch type (default is wall). No
            // constraint types (cyclic, symmetry) etc. are allowed.
            patchInfo
            {
                type wall;
            }
        }
    }

    // Applies maximum level of refinement to cells that can see intersections
    // whose angle exceeds resolveFeatureAngle (typically set to 30). 
    resolveFeatureAngle 30;
    
    // Region-wise refinement
    // ~~~~~~~~~~~~~~~~~~~~~~
    
    // Specifies refinement level for cells in relation to a surface. One of
    // three modes
    // - distance. 'levels' specifies per distance to the surface the
    //   wanted refinement level. The distances need to be specified in
    //   descending order.
    // - inside. 'levels' is only one entry and only the level is used. All
    //   cells inside the surface get refined up to the level. The surface
    //   needs to be closed for this to be possible.
    // - outside. Same but cells outside.
    refinementRegions
    {
        model
        {
            mode distance;
            levels (($nearGeometryRefinementDistance $nearGeometryRefinementLevel));
        }

        refinementCylinder
        {
            mode inside;
            levels ((1.0 $regionRefinementLevel));
        }
    }
}


// Settings for the snapping.
snapControls
{
    // Number of patch smoothing iterations before finding correspondence
    // to surface
    nSmoothPatch 3;

    // Relative distance for points to be attracted by surface feature point
    // or edge. True distance is this factor times local
    // maximum edge length.
    tolerance 1.0;

    // Number of mesh displacement relaxation iterations (typically 30-100).
    nSolveIter 100;

    // Maximum number of snapping relaxation iterations (typically 5).
    // Should stop before upon reaching a correct mesh.
    nRelaxIter 5;

    // Feature snapping

        // Number of feature edge snapping iterations.
        // Leave out altogether to disable.
        nFeatureSnapIter 10;

        // Detect (geometric only) features by sampling the surface
        // (default=false).
        implicitFeatureSnap true;

        // Use castellatedMeshControls::features (default = true)
        explicitFeatureSnap true;

        // Detect points on multiple surfaces (only for explicitFeatureSnap)
        multiRegionFeatureSnap true;

        //- When to run face splitting (never at first iteration, always
        //  at last iteration). Is interval. Default -1 (disabled)
        nFaceSplitInterval 5;
}


// Settings for the layer addition.
addLayersControls
{
}


// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    // maximum non-orthogonality allowed (degrees, typically 65). 
    // Set to 180 to disable.
    maxNonOrtho 45;

    // max boundary face skewness allowed (typically 20). 
    maxBoundarySkewness 20;

    // max internal face skewness allowed (typically 4). 
    maxInternalSkewness 4;

    // max concaveness allowed (typically 80). 
    // Set to 180 to disable.
    maxConcave 80;

    // ratio of minimum projected area to actual area (typically 0.5) 
    minFlatness 0.5;

    // minimum quality of tetrahedral cells from cell decomposition;
    // generally deactivated by setting large negative number since v5.0 when
    // new barycentric tracking was introduced, which could handle negative tets.
    //     <0 - inside out tet,
    //      0 - flat tet
    //      1 - regular tet
    minTetQuality 1e-9;

    // minimum cell pyramid volume
    // (typically 1e-13, large negative number disables). 
    minVol 1.0e-13;

    // minimum face area (typically -1). 
    minArea -1;

    // minimum face twist (typically 0.05). 
    minTwist 0.05;

    // minimum normalised cell determinant; 1 = hex; ≤ 0 = illegal cell
    // (typically 0.001). 
    minDeterminant 0.001;

    // 0->0.5 (typically 0.05). 
    minFaceWeight 0.05;

    // 0->1.0 (typically 0.01). 
    minVolRatio 0.01;

    // >0 for Fluent compatibility (typically -1). 
    minTriangleTwist -1;

    // number of error distribution iterations (typically 4). 
    nSmoothScale 4;

    // amount to scale back displacement at error points (typically 0.75). 
    errorReduction 0.75;

    // sub-dictionary that can include modified values for the above keyword
    // entries to be used when nRelaxedIter is exceeded in the layer addition
    // process.
    relaxed
    {
        maxNonOrtho 75;
    }
}

// Advanced

// Merge tolerance as fraction of bounding box of initial mesh. 
// Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1e-6;

// ************************************************************************* //
